; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=15, out_folder=training/easy, instance_id=49, seed=76

(define (problem blocksworld-49)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b2)
    (on b2 b15)
    (on b15 b10)
    (on b10 b11)
    (on b11 b14)
    (on b14 b9)
    (on-table b9)
    (clear b3)
    (on-table b3)
    (clear b12)
    (on b12 b13)
    (on b13 b1)
    (on b1 b5)
    (on b5 b4)
    (on b4 b7)
    (on b7 b8)
    (on b8 b6)
    (on-table b6))
 (:goal  (and 
    (clear b10)
    (on b10 b5)
    (on b5 b4)
    (on-table b4)
    (clear b9)
    (on-table b9)
    (clear b14)
    (on b14 b6)
    (on b6 b15)
    (on b15 b13)
    (on b13 b3)
    (on b3 b7)
    (on b7 b12)
    (on b12 b11)
    (on b11 b2)
    (on b2 b1)
    (on b1 b8)
    (on-table b8))))

; plan
1. (unstack b12 b13)
   deleted: (on b12 b13) (clear b12) (arm-empty)
   added: (holding b12) (clear b13)
   goals met: 2 of 18
2. (stack b12 b3)
   deleted: (clear b3) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b3)
   goals met: 2 of 18
3. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 2 of 18
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 18
5. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 2 of 18
6. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 2 of 18
7. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 1 of 18
8. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 1 of 18
9. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 1 of 18
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 18
11. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 2 of 18
12. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 3 of 18
13. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 3 of 18
14. (stack b7 b13)
   deleted: (clear b13) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b13)
   goals met: 3 of 18
15. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 3 of 18
16. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 18
17. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 4 of 18
18. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 5 of 18
19. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 5 of 18
20. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 6 of 18
21. (unstack b15 b10)
   deleted: (on b15 b10) (clear b15) (arm-empty)
   added: (holding b15) (clear b10)
   goals met: 7 of 18
22. (stack b15 b6)
   deleted: (clear b6) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b6)
   goals met: 7 of 18
23. (unstack b10 b11)
   deleted: (on b10 b11) (clear b10) (arm-empty)
   added: (holding b10) (clear b11)
   goals met: 6 of 18
24. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 8 of 18
25. (unstack b11 b14)
   deleted: (on b11 b14) (clear b11) (arm-empty)
   added: (holding b11) (clear b14)
   goals met: 9 of 18
26. (stack b11 b2)
   deleted: (clear b2) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b2)
   goals met: 10 of 18
27. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 10 of 18
28. (stack b12 b11)
   deleted: (clear b11) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b11)
   goals met: 11 of 18
29. (unstack b7 b13)
   deleted: (on b7 b13) (clear b7) (arm-empty)
   added: (holding b7) (clear b13)
   goals met: 11 of 18
30. (stack b7 b12)
   deleted: (clear b12) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b12)
   goals met: 12 of 18
31. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 12 of 18
32. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 13 of 18
33. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 13 of 18
34. (stack b13 b3)
   deleted: (clear b3) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b3)
   goals met: 14 of 18
35. (unstack b15 b6)
   deleted: (on b15 b6) (clear b15) (arm-empty)
   added: (holding b15) (clear b6)
   goals met: 14 of 18
36. (stack b15 b13)
   deleted: (clear b13) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b13)
   goals met: 15 of 18
37. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 15 of 18
38. (stack b6 b15)
   deleted: (clear b15) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b15)
   goals met: 16 of 18
39. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 16 of 18
40. (stack b14 b6)
   deleted: (clear b6) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b6)
   goals met: 18 of 18
